Revit 2027 API
UV.IsAlmostEqualTo(UV) Method
Determines whether this 2-D vector and the specified 2-D vector are the same within the tolerance (1.0e-09).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAlmostEqualTo(
	UV source
)
Public Function IsAlmostEqualTo (
	source As UV
) As Boolean
public:
bool IsAlmostEqualTo(
	UV^ source
)
member IsAlmostEqualTo :
        source : UV -> bool
Parameters
source UV
The vector to compare with this vector.
Return Value
Boolean
True if the vectors are the same; otherwise, false.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when left is null.
See Also
Reference
UV Class
IsAlmostEqualTo Overload
Autodesk.Revit.DB Namespace